function [image] = openfile( )
%OPENFILE 此处显示有关此函数的摘要
%   此处显示详细说明
%
%   输出参数:
%   image：用户所读入图片
global image_show;
%===================================================================
%===================================================================
     %%%%%%%%%%%%%%%%%%%%
    %资源管理器中读取任何格式的文件，默认文件名为‘myFace.jpg’
    %%%%%%%%%%%%%%%%%%%%%
        [f,p]=uigetfile('*.*','选择图像文件','myFace.jpg');
        if f           
            try
                image=imread(strcat(p,f)); 
            catch
                     %%%%%%%%%%%%%%%%%%%%
                     %如果imread读入函数报错，则报错提示该文件不可被读入
                     %%%%%%%%%%%%%%%%%%%%%
                errordlg('file can not be readed','Error','replace');
            end                
        else
                      %%%%%%%%%%%%%%%%%%%%
                     %如果用户没有选择文件，则提示选择不可以为空，等待用户重新点击openfile按钮
                     %%%%%%%%%%%%%%%%%%%%%
           errordlg('choice can not be empty','Error','replace');            
        end
%=================================================================
%=================================================================
 %%%%%%%%%%%%%%%%%%%%
 %打印图片至image_show
 %%%%%%%%%%%%%%%%%%%%%
imshow(image,'parent',image_show);
end

